---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidBaseConstraintForLevel
source: html/32709577-3160-b903-4045-5bfd3f58b75f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidBaseConstraintForLevel Property

Base Constraint is invalid for the Level.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidBaseConstraintForLevel { get; }
```